{
  "termsAndConditions": "Yet Another Wiki Terms of Service\nLast Updated: November 25, 2024\nA. Definitions\n\n\"Yet Another Wiki,\" \"we,\" \"us,\" and \"our\" refer to Yet Another Wiki and its owner/operator John Overton.\n\"Service\" means the Yet Another Wiki website, located at YetAnotherWiki.com, and all services provided by Yet Another Wiki.\n\"User,\" \"you,\" and \"your\" refer to any individual or entity using our Service.\n\"Content\" means any text, data, information, code, software, graphics, wikis, or other materials created, submitted, or displayed on the Service.\n\"Open Source Software\" refers to the Yet Another Wiki software released under the MIT License.\n\"Pro License\" refers to the paid licensing option that enables multi-user functionality.\n\nB. Account Terms\n\nRequired Information\n\nYou must provide a valid email address to create an account\nAny other information requested is optional unless required for billing purposes\n\nAccount Requirements\n\nYou must be a human to create an account; automated account creation is prohibited\nOne person or legal entity may maintain only one account\nYou must be at least 13 years old to use this Service\nYour login credentials may only be used by you and cannot be shared\n\nAccount Security\n\nYou are responsible for maintaining the security of your account and password\nYou must notify us immediately of any unauthorized access\nYet Another Wiki cannot and will not be liable for any loss due to failure to comply with security obligations\nYou are responsible for all content posted and activity under your account\n\nC. Acceptable Use\n\nGeneral Conduct\n\nUsers must behave ethically and professionally\nUsers must respect the rights of other users\nUsers must not use the Service for any illegal purposes\nUsers must not attempt to harm or disrupt the Service or other users\n\nProhibited Actions\n\nHarassment or abuse of other users\nPosting illegal or harmful content\nAttempting to gain unauthorized access to any part of the Service\nReverse engineering the Service for malicious purposes\nUsing the Service to distribute malware or conduct malicious activities\nCircumventing the licensing system\nAutomated scanning or scraping without permission\n\nAPI Usage\n\nLicense verification API is limited to 300 requests per hour per IP address\nExceeding this limit will result in a 24-hour IP block\nAttempting to circumvent API limits is prohibited\n\nContent Guidelines\n\nYou are responsible for all content you post\nContent must not violate any applicable laws\nContent must not infringe on others' intellectual property rights\nWe reserve the right to remove any content that violates these terms\n\nD. Content & Licensing\n\n1. Open Source License\n   - Yet Another Wiki software is released under the MIT License, as stated in our license file\n   - The full MIT License terms are incorporated into these Terms of Service by reference\n   - You may freely use, modify, and distribute the software according to the MIT License terms\n   - You must include the original copyright notice and license in any copy or substantial portion of the software\n\n2. Pro Licensing\n   - Pro License is priced at $30 per license with unlimited users\n   - Pro License enables multi-user functionality\n   - License keys must be obtained through official channels\n   - You may implement your own licensing system for your instance of the software\n   - Pro License fees support ongoing development and maintenance\n\n3. User-Generated Content\n   - You retain ownership of content you create\n   - You grant Yet Another Wiki a license to store, display, and distribute your content as needed to provide the Service\n   - You are responsible for ensuring you have the right to post any content you submit\n   - We may remove any content that violates these terms\n\n4. Third-Party Components\n   - The software includes third-party open source components\n   - Each component is subject to its own license terms\n   - Users are responsible for compliance with all third-party licenses\n   - A complete list of dependencies and licenses is available in the package.json file\n\nE. Payment Terms\n\n1. Billing\n   - All payments are processed through Stripe\n   - Prices are listed in US Dollars\n   - Pro Licenses are billed at $30 per license\n   - Payments are non-refundable unless required by law\n   - We reserve the right to change pricing with 30 days notice\n\n2. Payment Processing\n   - You agree to provide accurate billing information\n   - You authorize us to charge your payment method\n   - Failed payments may result in service interruption\n   - You are responsible for any applicable taxes\n\n3. Renewals and Cancellations\n   - Pro Licenses renew automatically\n   - You may cancel at any time\n   - No refunds for partial periods\n   - Cancellation takes effect at the end of the current billing period\n\nF. Liability & Disclaimers\n\n1. Service Warranty Disclaimer\n   - The Service is provided \"AS IS\" without any warranty\n   - We make no guarantees about reliability, accuracy, or availability\n   - We are not responsible for any data loss or security breaches\n   - We do not warrant that the Service will be error-free or uninterrupted\n\n2. User Responsibility\n   - You are solely responsible for your use of the Service\n   - You are responsible for any content you post or store\n   - You are responsible for maintaining appropriate security measures\n   - You are responsible for compliance with all applicable laws\n\n3. Limitation of Liability\n   - We shall not be liable for any indirect, incidental, special, consequential, or punitive damages\n   - Our total liability shall not exceed the amount paid by you for the Service in the past 12 months\n   - We are not liable for any third-party claims against you\n\n4. Indemnification\n   - You agree to indemnify and hold us harmless from any claims arising from your use of the Service\n   - This includes claims related to your content or violation of these terms\n   - You will defend us against any third-party claims at your expense\n\nG. Intellectual Property\n\n1. Ownership\n   - Yet Another Wiki owns all rights to the Service branding and trademarks\n   - The software is open source under the MIT License\n   - Users retain rights to their content\n   - Third-party components retain their original ownership\n\n2. License Grant\n   - Software is licensed under MIT License\n   - Pro License grants additional usage rights\n   - User content licenses remain with users\n   - Attribution requirements must be maintained\n\nH. Termination\n\n1. Account Termination\n   - You may terminate your account at any time\n   - We may terminate accounts for violations of these terms\n   - We may terminate the Service with reasonable notice\n   - Pro License fees are non-refundable upon termination\n\n2. Effect of Termination\n   - Content may be deleted upon termination\n   - You remain liable for all fees incurred\n   - Sections F, G, and I survive termination\n   - You may retain copies of the open source software\n\nI. Miscellaneous\n\n1. Governing Law\n   - These terms are governed by California law\n   - Any disputes will be resolved in California courts\n   - You agree to personal jurisdiction in California\n\n2. Changes to Terms\n   - We may modify these terms at any time\n   - Material changes require 30 days notice\n   - Continued use constitutes acceptance of changes\n\n3. Contact Information\n   - Questions can be directed to info@jroverton.com\n   - Support is provided in English only\n   - Emergency issues should be reported promptly\n\n4. Severability\n   - If any provision is found invalid, others remain in effect\n   - Invalid terms will be modified to be valid\n   - These terms constitute the entire agreement\n\n5. Assignment\n   - We may assign these terms without restriction\n   - You may not assign your rights without our consent\n   - These terms bind any permitted successors\n\nThese terms are effective as of November 25, 2024.",
  "privacyPolicy": "Yet Another Wiki Privacy Policy\n\nLast Updated: November 25, 2024\n\nWelcome!\n\nHi there! We're glad you're interested in learning about how Yet Another Wiki handles your privacy. We believe in keeping things straightforward and transparent, so we've written this privacy policy to be as clear and readable as possible while covering all the important details you need to know.\n\n1. Introduction\n\n1.1 Purpose of This Policy\n\nThis privacy policy explains how Yet Another Wiki (\"we,\" \"us,\" or \"our\") collects, uses, and protects your information when you use our wiki platform. We value your privacy and aim to protect it as if it were our own.\n\n1.2 About Yet Another Wiki\n\nYet Another Wiki is a Next.js-based wiki platform owned and operated by John Overton (sole proprietor). Our platform allows users to create, share, and manage wiki content while maintaining appropriate privacy and security measures.\n\n1.3 Contact Information\n\nIf you have any questions or concerns about this privacy policy or our privacy practices, please contact us at:\n\n- Email: info@jroverton.com\n- Owner: John Overton\n\n1.4 Scope of This Policy\n\nThis privacy policy applies to:\n- The YetAnotherWiki.com website\n- All related services and features\n- User accounts and profiles\n- Any interaction with our platform\n\n1.5 Your Agreement\n\nBy using Yet Another Wiki, you agree to the collection and use of information as described in this policy. We encourage you to read this document carefully to understand our practices regarding your personal information.\n\n1.6 Important Note About Security\n\nWhile we implement strong security measures to protect your information, your security on Yet Another Wiki also depends on your own best practices. John Overton and Yet Another Wiki cannot be held liable for any information you inadvertently disclose through your own actions.\n\n1.7 Our Core Privacy Principles\n\n- We only collect information that's necessary for the platform's operation\n- We don't sell your information to anyone\n- We use your information solely for business activities on YetAnotherWiki.com\n- We encrypt sensitive information like passwords and security questions\n- We respect your privacy rights and give you control over your information\n\n2. Information We Collect\n\n2.1 Account Registration Information\n\nWhen you create an account on Yet Another Wiki, we collect:\n- Your name\n- Email address\n- Password (encrypted)\n- Security question answers (encrypted)\n\n2.2 Automatically Collected Information\n\nOur system automatically collects certain information for security and operational purposes:\n- IP addresses\n- Session data\n- Login timestamps\n- Browser type and version\n- Operating system information\n- Pages visited within the wiki\n\n2.3 How We Collect Information\n\nWe collect information in two ways:\n- Directly from you when you provide it (such as during registration)\n- Automatically through our platform's operation (such as IP addresses and session data)\n\n2.4 Session Data\n\nTo maintain security and provide a better user experience, we track:\n- Session duration\n- Login attempts\n- Last active timestamp\n- Session identifiers\nThis information helps us protect accounts from unauthorized access and maintain platform security.\n\n2.5 Security and Authentication Data\n\nFor account security purposes, we:\n- Store all passwords using industry-standard encryption\n- Encrypt security question answers\n- Never store passwords in plain text\n- Maintain secure session tokens\n- Track failed login attempts to prevent abuse\n\n2.6 Optional Information\n\nYou may choose to provide additional information when using our platform, such as:\n- Profile information\n- Wiki contributions\n- Comments or feedback\nThis information is stored in association with your account but is not required for basic platform use.\n\n2.7 Information We Don't Collect\n\nTo maintain your privacy, we do not collect:\n- Credit card or payment information\n- Social security numbers\n- Government identification\n- Personal documents\n- Information about your activities on other websites\n\n3. How We Use Your Information\n\n3.1 Core Platform Operations\n\nWe use your information to:\n- Maintain and operate your wiki account\n- Authenticate your identity when you log in\n- Process and display your wiki contributions\n- Provide customer support when needed\n- Send important account notifications\n\n3.2 Security and Protection\n\nYour information helps us:\n- Prevent unauthorized access to accounts\n- Detect and prevent abuse of our platform\n- Monitor for suspicious activity\n- Protect the wiki from spam and malicious content\n- Maintain the overall security of our platform\n\n3.3 Session Management\n\nWe use session data to:\n- Keep you logged in securely\n- Track active sessions\n- Protect against session hijacking\n- Monitor for unusual activity\n- Ensure proper account logout\n\n3.4 Communication\n\nWe may use your email address to:\n- Send account verification messages\n- Provide important security alerts\n- Notify you about significant platform changes\n- Respond to your support requests\n- Send password reset links when requested\n\n3.5 Platform Improvement\n\nWe analyze usage data to:\n- Improve wiki functionality\n- Fix technical issues\n- Enhance user experience\n- Optimize platform performance\n- Identify areas needing improvement\n\n3.6 Legal Compliance\n\nWe may use information to:\n- Comply with legal obligations\n- Respond to legal requests when required by law\n- Protect our legal rights\n- Enforce our terms of service\n\n3.7 What We Don't Do With Your Information\n\nWe want to be clear that we do not:\n- Sell your personal information\n- Share your data with third parties\n- Use your information for marketing purposes\n- Create user profiles for advertising\n- Track you across other websites\n\n4. Data Storage and Security\n\n4.1 Data Storage Practices\n\nOur data is stored:\n- On secure servers located in the United States\n- Using industry-standard database security practices\n- With regular backups to prevent data loss\n- In an encrypted format for sensitive information\n\n4.2 Security Measures\n\nWe protect your data through:\n- HTTPS encryption for all web traffic\n- Secure password hashing using modern algorithms\n- Encrypted storage of security question answers\n- Regular security audits and updates\n- Monitoring for unauthorized access attempts\n\n4.3 Access Controls\n\nWe maintain strict access controls by:\n- Limiting administrator access to essential personnel\n- Requiring strong authentication for system access\n- Maintaining detailed access logs\n- Regularly reviewing access permissions\n- Implementing role-based access control\n\n4.4 Data Retention\n\nWe retain your data:\n- As long as your account remains active\n- For a reasonable period after account deletion to prevent abuse\n- In accordance with legal requirements\n- Until you request complete data removal\n- In backup systems for disaster recovery\n\n4.5 Security Incident Response\n\nIn the event of a security incident, we will:\n- Investigate the cause immediately\n- Notify affected users as required by law\n- Take steps to prevent similar incidents\n- Work with security experts if necessary\n- Implement additional safeguards as needed\n\n4.6 Encryption Practices\n\nWe use encryption for:\n- All passwords stored in our system\n- Security question answers\n- Session tokens\n- Database backups\n- Sensitive user information\n\n4.7 Your Security Responsibilities\n\nTo help maintain security, you should:\n- Choose a strong, unique password\n- Keep your security questions private\n- Never share your login credentials\n- Log out when using shared computers\n- Report any suspicious activity to us\n\n5. Information Sharing and Disclosure\n\n5.1 Our Sharing Policy\n\nWe maintain a strict policy of not sharing your personal information. Specifically:\n- We do not sell your data to any third parties\n- We do not share your information for marketing purposes\n- We do not provide your data to advertisers\n- We do not distribute email addresses or personal details\n- We keep your security question answers strictly confidential\n\n5.2 Limited Operational Sharing\n\nWe may need to share limited information with:\n- Our hosting provider to maintain the service\n- Security services that help protect the platform\n- Database backup services\nThese providers are bound by strict confidentiality agreements and only use your information to provide necessary services.\n\n5.3 Legal Requirements\n\nWe may disclose information if:\n- Required by law\n- Served with a valid court order\n- Needed to respond to a valid legal process\n- Necessary to protect our legal rights\n- Required to prevent harm or illegal activities\n\n5.4 Account Information\n\nYour public wiki contributions may be visible to:\n- Other registered users\n- Site visitors (if set to public)\n- Search engines (if set to public)\nHowever, your email address and security information remain private.\n\n5.5 Business Transfers\n\nIf Yet Another Wiki is ever:\n- Sold\n- Merged with another company\n- Transferred to new ownership\nWe will notify you before any personal information is transferred and becomes subject to a different privacy policy.\n\n5.6 Aggregate Data\n\nWe may share:\n- Anonymous usage statistics\n- Aggregated user behavior data\n- Platform performance metrics\nThis information never includes personal identification details.\n\n5.7 Third-Party Links\n\nWhile our wiki may contain links to other websites:\n- We are not responsible for their privacy practices\n- Your information is not automatically shared with them\n- Their privacy policies may differ from ours\n- We recommend reviewing their policies separately\n\n6. User Rights and Controls\n\n6.1 Your Account Rights\n\nAs a Yet Another Wiki user, you have the right to:\n- Access your personal information\n- Update your account details\n- Change your password and security questions\n- Control the visibility of your contributions\n- Delete your account and associated data\n\n6.2 Accessing Your Information\n\nYou can access your information by:\n- Logging into your account\n- Viewing your profile settings\n- Reviewing your contribution history\n- Checking your account activity log\n- Requesting a data export of your information\n\n6.3 Updating Your Information\n\nYou can modify your information by:\n- Editing your profile settings\n- Updating your email address\n- Changing your security questions\n- Modifying your password\n- Updating your display name\n\n6.4 Account Deletion\n\nIf you choose to delete your account:\n- You can request account deletion through your settings\n- We will confirm your identity before proceeding\n- Your personal information will be removed\n- Public contributions may remain unless specifically requested\n- Deletion is permanent and cannot be undone\n\n6.5 Data Retention After Deletion\n\nAfter account deletion:\n- We retain minimal information to prevent abuse\n- Backup archives may contain data for up to 90 days\n- Some information may be retained for legal compliance\n- Public contributions remain unless specifically removed\n- Associated logs are automatically purged after 90 days\n\n6.6 Communication Preferences\n\nYou can control:\n- What notifications you receive\n- How we communicate with you\n- Whether to receive security alerts\n- Account-related communications\nNote: Some system notifications cannot be disabled for security reasons\n\n6.7 Data Portability\n\nWe support your right to:\n- Export your wiki contributions\n- Download your account information\n- Transfer your content\n- Receive a copy of your data\n- Move your information as needed\n\n7. Children's Privacy\n\n7.1 Age Restrictions\n\nTo protect young users:\n- Users must be 13 years or older to create an account\n- We do not knowingly collect information from children under 13\n- Parents should supervise children's internet usage\n- Underage accounts will be terminated when discovered\n- We comply with the Children's Online Privacy Protection Act (COPPA)\n\n7.2 Verification Process\n\nWe take reasonable steps to verify age by:\n- Requiring birth date during registration\n- Monitoring content and behavior patterns\n- Investigating reports of underage users\n- Implementing appropriate security measures\n- Responding promptly to age-related concerns\n\n7.3 Discovery of Underage Users\n\nIf we discover a user is under 13:\n- The account will be immediately suspended\n- All personal information will be deleted\n- Parents will be notified when possible\n- Any content created will be removed\n- No refunds will be issued for paid services\n\n7.4 Parental Rights\n\nParents or legal guardians:\n- Can request information about their child's account\n- May request deletion of their child's information\n- Must provide verification of their identity\n- Should report underage accounts\n- Can contact us with concerns about youth privacy\n\n7.5 Educational Use\n\nFor educational institutions:\n- Special arrangements may be made for supervised use\n- Teachers must obtain parental consent\n- School administration must oversee usage\n- Additional privacy protections will be implemented\n- Direct contact with support is required\n\n7.6 Content Guidelines\n\nTo protect young users, we:\n- Monitor content for age-appropriate material\n- Remove inappropriate content\n- Block certain features for youth safety\n- Implement reporting tools\n- Maintain family-friendly standards\n\n7.7 Reporting Concerns\n\nAnyone can report concerns about underage users by:\n- Using our reporting system\n- Emailing info@jroverton.com\n- Contacting platform administrators\n- Flagging suspicious content\n- Notifying us of potential violations\n\n8. Changes to This Policy\n\n8.1 Policy Updates\n\nWe may update this privacy policy:\n- To reflect changes in our practices\n- To comply with new regulations\n- To address new features or services\n- To improve clarity and understanding\n- As needed for platform operations\n\n8.2 Notification of Changes\n\nWhen we make changes:\n- Significant changes will be announced via email\n- Updates will be posted on our website\n- The \"Last Updated\" date will be modified\n- Users may be required to acknowledge changes\n- A changelog will be maintained for transparency\n\n8.3 Review Period\n\nFor major changes:\n- Users will be given 30 days notice before implementation\n- Changes will be clearly highlighted\n- Previous versions will remain accessible\n- Users can review and compare changes\n- Questions about changes will be addressed\n\n8.4 Your Rights Regarding Changes\n\nWhen we update the policy:\n- You have the right to review changes\n- You can choose to accept or reject changes\n- Rejecting changes may limit account access\n- You can delete your account if you disagree\n- You can request clarification about changes\n\n8.5 Communication Methods\n\nWe will notify users of changes through:\n- Email notifications\n- Website announcements\n- Account notifications\n- Blog posts (when applicable)\n- Platform updates\n\n8.6 Documentation of Changes\n\nWe maintain:\n- A history of policy versions\n- Summaries of significant changes\n- Dates of updates\n- Explanations of major revisions\n- Archives of previous policies\n\n8.7 Continuous Improvement\n\nWe regularly:\n- Review our privacy practices\n- Update security measures\n- Incorporate user feedback\n- Adapt to new technologies\n- Enhance user privacy protections\n\n9. Security Practices and User Responsibilities\n\n9.1 Platform Security\n\nWe maintain security through:\n- Regular security audits\n- System monitoring\n- Encrypted connections (HTTPS)\n- Secure server configuration\n- Regular software updates\n\n9.2 User Responsibilities\n\nTo maintain account security, you should:\n- Create a strong, unique password\n- Never share your login credentials\n- Keep security questions private\n- Log out from shared devices\n- Report suspicious activity immediately\n\n9.3 Password Guidelines\n\nWe recommend passwords that:\n- Are at least 12 characters long\n- Combine letters, numbers, and symbols\n- Avoid personal information\n- Are not used on other websites\n- Are changed periodically\n\n9.4 Best Practices\n\nFor optimal security:\n- Enable two-factor authentication if available\n- Use a password manager\n- Check your account activity regularly\n- Keep your email address current\n- Be cautious with public networks\n\n9.5 Account Protection\n\nUsers are responsible for:\n- All activity under their account\n- Maintaining their password security\n- Keeping recovery information updated\n- Reporting unauthorized access\n- Following security guidelines\n\n9.6 Incident Reporting\n\nIf you notice suspicious activity:\n- Contact us immediately at info@jroverton.com\n- Change your password\n- Review recent account activity\n- Check for unauthorized changes\n- Follow our security team's instructions\n\n9.7 Liability Limitations\n\nPlease understand that:\n- We cannot guarantee absolute security\n- Users are responsible for their own actions\n- We are not liable for compromised credentials\n- Security depends on user practices\n- Some risks are inherent to internet use\n\n10. Contact Information\n\n10.1 How to Reach Us\n\nYou can contact Yet Another Wiki by:\n- Email: info@jroverton.com\n- Owner: John Overton\n- Website: YetAnotherWiki.com\nResponse time is typically within 2 business days\n\n10.2 Privacy Concerns\n\nFor privacy-specific issues:\n- Use the subject line \"Privacy Concern\" in emails\n- Include your account username (if applicable)\n- Provide relevant details about your concern\n- Specify if it's time-sensitive\n- Include any relevant screenshots or documentation\n\n10.3 Security Reports\n\nTo report security vulnerabilities:\n- Email us immediately at info@jroverton.com\n- Use the subject line \"Security Alert\"\n- Provide detailed information about the issue\n- Include steps to reproduce the problem\n- Do not share vulnerability details publicly\n\n10.4 Account Support\n\nFor account-related assistance:\n- Include your username\n- Describe your issue clearly\n- Provide relevant timestamps\n- Mention any error messages\n- Use clear subject lines\n\n10.5 Legal Inquiries\n\nFor legal matters:\n- Send formal requests to info@jroverton.com\n- Include any relevant documentation\n- Provide deadline requirements\n- Include your contact information\n- State the nature of your inquiry\n\n10.6 Response Times\n\nWe strive to respond:\n- Within 24 hours for security issues\n- Within 2 business days for privacy concerns\n- Within 2 business days for account support\n- Within 5 business days for general inquiries\n- As required by law for legal requests\n\n10.7 Business Hours\n\nOur support team is available:\n- Monday through Friday\n- During normal business hours (9 AM - 5 PM EST)\n- Excluding major US holidays\n- With monitoring for urgent security issues\n- With flexibility for emergency situations"
}